# Airline Customer Analytics

**Data Pre-Processing & EDA**

**Date:** 20 Jan, 2026

---

## Importing Required Packages

In [1]:
# --- Data Analysis ---
import pandas as pd

---

## Data Pre-Processing

### Load the Data

#### Load Customer Loyalty History data

In [2]:
clh_csv_path_local = "../data/raw/Customer Loyalty History.csv"
clh_df = pd.read_csv(clh_csv_path_local)

df = clh_df.copy()

df.columns = [c.strip().lower().replace(" ", "_") for c in df.columns]

df["loyalty_number"] = df["loyalty_number"].astype("int64")
df["salary"] = df["salary"].astype("float64")
df["clv"] = df["clv"].astype("float64")

df["enrollment_year"] = df["enrollment_year"].astype("int64")
df["enrollment_month"] = df["enrollment_month"].astype("int64")

df["cancellation_year"] = df["cancellation_year"].astype("Int64")
df["cancellation_month"] = df["cancellation_month"].astype("Int64")

string_cols = [
    "country",
    "province",
    "city",
    "postal_code",
    "gender",
    "education",
    "marital_status",
    "loyalty_card",
    "enrollment_type",
]
df[string_cols] = df[string_cols].astype("string")

clh_df = df.copy()
clh_df.head()

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,<NA>,<NA>
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,<NA>,<NA>
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018,1
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,<NA>,<NA>
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,<NA>,<NA>

In [3]:
clh_df.to_parquet("../data/processed/clh.parquet", index=False)

#### Load Customer Flight Activity data

In [4]:
cfa_csv_path_local = "../data/raw/Customer Flight Activity.csv"
cfa_df = pd.read_csv(cfa_csv_path_local)

df = cfa_df.copy()

df.columns = [c.strip().lower().replace(" ", "_") for c in df.columns]

cfa_df = df.copy()
cfa_df.head()

,loyalty_number,year,month,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
0,100590,2018,6,12,15276,22914.0,0,0
1,100590,2018,7,12,9168,13752.0,0,0
2,100590,2018,5,4,6504,9756.0,0,0
3,100590,2018,10,0,0,0.0,512,92
4,100590,2018,2,0,0,0.0,0,0

In [5]:
cfa_df.to_parquet("../data/processed/cfa.parquet", index=False)